In [3]:
import pandas as pd
import numpy as np 
from matplotlib import pyplot as plt 
import seaborn as sns

In [7]:
df = pd.read_csv('./MyTransaction.csv')

In [8]:
df.head()

       Date Category     RefNo    Date.1  Withdrawal  Deposit  Balance
0       NaN      NaN       NaN       NaN         NaN      NaN      NaN
1  1/1/2023     Rent  3.00E+11  1/1/2023      3950.0      0.0  1837.23
2  3/1/2023     Misc  3.00E+11  3/1/2023       105.0      0.0  1732.23
3  3/1/2023     Misc  3.37E+11  3/1/2023         0.0     55.0  1787.23
4  3/1/2023     Food  3.00E+11  3/1/2023        56.0      0.0  1731.23

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        1469 non-null   object
 1   Category    1469 non-null   object
 2   RefNo       1469 non-null   object
 3   Date.1      1469 non-null   object
 4   Withdrawal  1469 non-null   float64
 5   Deposit     1469 non-null   float64
 6   Balance     1469 non-null   float64
dtypes: float64(3), object(4)
memory usage: 80.5+ KB

In [10]:
df.isna().sum()

Date          1
Category      1
RefNo         1
Date.1        1
Withdrawal    1
Deposit       1
Balance       1
dtype: int64

In [11]:
# only the first row has null values so i am droping it
df.dropna(inplace= True)

In [12]:
df.isna().sum()

Date          0
Category      0
RefNo         0
Date.1        0
Withdrawal    0
Deposit       0
Balance       0
dtype: int64

In [13]:
df.head()

       Date Category     RefNo    Date.1  Withdrawal  Deposit  Balance
1  1/1/2023     Rent  3.00E+11  1/1/2023      3950.0      0.0  1837.23
2  3/1/2023     Misc  3.00E+11  3/1/2023       105.0      0.0  1732.23
3  3/1/2023     Misc  3.37E+11  3/1/2023         0.0     55.0  1787.23
4  3/1/2023     Food  3.00E+11  3/1/2023        56.0      0.0  1731.23
5  3/1/2023     Misc  3.37E+11  3/1/2023         1.0      0.0  1730.23

In [14]:
# Date and Date.1 seems like duplicated columns let's check it they have same values
sum(df['Date'] == df['Date.1'])

1447

In [15]:
df.shape

(1469, 7)

In [16]:
df.drop(columns=['RefNo','Date.1'], inplace= True)

In [17]:
# Renaming the columns for easier use 
df.rename(columns={'Date':'date',
                   'Category':'category',
                   'Withdrawal':'withdrawal',
                   'Deposit':'deposit',
                   'Balance':'balance'
                  }, inplace = True)

In [18]:
df.head()

       date category  withdrawal  deposit  balance
1  1/1/2023     Rent      3950.0      0.0  1837.23
2  3/1/2023     Misc       105.0      0.0  1732.23
3  3/1/2023     Misc         0.0     55.0  1787.23
4  3/1/2023     Food        56.0      0.0  1731.23
5  3/1/2023     Misc         1.0      0.0  1730.23

In [19]:
df['date'] = pd.to_datetime(df['date'] , format = "mixed",dayfirst=True)

In [20]:
df.head()

        date category  withdrawal  deposit  balance
1 2023-01-01     Rent      3950.0      0.0  1837.23
2 2023-01-03     Misc       105.0      0.0  1732.23
3 2023-01-03     Misc         0.0     55.0  1787.23
4 2023-01-03     Food        56.0      0.0  1731.23
5 2023-01-03     Misc         1.0      0.0  1730.23

In [21]:
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day

In [22]:
df.drop(columns=['date'],inplace=True)

In [23]:
df.head()

  category  withdrawal  deposit  balance  year  month  day
1     Rent      3950.0      0.0  1837.23  2023      1    1
2     Misc       105.0      0.0  1732.23  2023      1    3
3     Misc         0.0     55.0  1787.23  2023      1    3
4     Food        56.0      0.0  1731.23  2023      1    3
5     Misc         1.0      0.0  1730.23  2023      1    3

In [24]:
df.duplicated().sum()

5

In [25]:
df.drop_duplicates(inplace= True)

In [26]:
df.shape

(1464, 7)

In [ ]:
//EDA se start karo